ContractCreate/ContractCreate OldPerson OldSpouse OldChild - Check.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <ContractCreate xmlns="http://www.csc.com/graphtalk/aia/" xmlns:gtx="graphtalk.aia.extension">
            <Environment>
                <Profiles>
                    <String>all_user</String>
                </Profiles>
                <UserID>AYANAKIEV3</UserID>
            </Environment>
            <ActivityRequest>
                <EffectiveDate>2012-10-23</EffectiveDate>
                <RequestDate>2012-10-23</RequestDate>
            </ActivityRequest>
            <Contract>
                <ReceivedDate>2012-10-23</ReceivedDate>
                <SignatureDate>2012-10-23</SignatureDate>
                <ProductOption>
                    <Identifier>opt2</Identifier>
                    <Label>Modular Health Offer</Label>
                    <PackageList>
                        <Package>
                            <Identifier>51</Identifier>
                            <Label>Hospital Cover</Label>
                            <CoverageList>
                                <Coverage>
                                    <Identifier>67</Identifier>
                                    <Label>Young Hospital No Excess</Label>
                                    <MembershipList>
                                        <Membership>
                                            <Type>insured</Type>
                                            <Person>
                                            	<ClientNumber>511248</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>spouse</Type>
                                            <Person>
                                            	<ClientNumber>511259</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>child</Type>
                                            <Person>
                                            	<ClientNumber>507801</ClientNumber>
                                            </Person>
                                        </Membership>
                                    </MembershipList>
                                </Coverage>
                                <Coverage>
                                	<Identifier>52</Identifier>
                                    <Label>Basic Hospital Excess $250</Label>
                                    <MembershipList>
                                    	<Membership>
                                        	    <Type>child</Type>
                                            	<Person>
                                            		<ClientNumber>507801</ClientNumber>
                                            	</Person>
                                        </Membership>
                                    </MembershipList>
                                </Coverage>
                            </CoverageList>
                        </Package>
                        <Package>
                            <Identifier>39</Identifier>
                            <Label>Extras</Label>
                            <CoverageList>
                                <Coverage>
                                    <Identifier>73</Identifier>
                                    <Label>Basic Extras 55% back</Label>
                                    <MembershipList>
                                        <Membership>
                                            <Type>insured</Type>
                                            <Person>
                                            	<ClientNumber>511248</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>spouse</Type>
                                            <Person>
                                            	<ClientNumber>511259</ClientNumber>
                                            </Person>
                                        </Membership>
                                        <Membership>
                                            <Type>child</Type>
                                            <Person>
                                            	<ClientNumber>507801</ClientNumber>
                                            </Person>
                                        </Membership>
                                    </MembershipList>
                                </Coverage>
                            </CoverageList>
                        </Package>
                    </PackageList>
                </ProductOption>
                <ProductIdentifier>HE_MEDI01</ProductIdentifier>
                <BillingList>
                    <Billing>
                        <BillReceiver>owner</BillReceiver>
                        <Frequency>monthly</Frequency>
                        <FrequencyType>anniversary</FrequencyType>
                        <PaymentType>check_deposit</PaymentType>
                        <DueDateType>in_advance</DueDateType>
                        <Payer>
                            <Person>
                            	<ClientNumber>511248</ClientNumber>
                            </Person>
                        </Payer>
                    </Billing>
                </BillingList>
                <RoleList>
                    <PartyRole>
                        <RoleType>disT</RoleType>
                        <Identifier>AP00000001</Identifier>
                        <Main>true</Main>
                    </PartyRole>
                    <PartyRole>
                        <RoleType>owner</RoleType>
                        <Person>
                        	<ClientNumber>511248</ClientNumber>
                        </Person>
                    </PartyRole>
                    <PartyRole>
                        <Person>
                            <ClientNumber>511259</ClientNumber>
                        </Person>
                     </PartyRole>
                     <PartyRole>
                        <Person>
                             <ClientNumber>507801</ClientNumber>
                        </Person>
                      </PartyRole>
                </RoleList>
            </Contract>
        </ContractCreate>
    </soap:Body>
</soap:Envelope>